# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [204]:
# Your code here
import numpy as np
import pandas as pd
df=pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv')
display(df)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [205]:
def clean_column(df: pd.DataFrame):
    '''
#Here I replaced the capital letter with lower, replaced st with state and the space with _. although the last part made my code too specific which is not a good approach for functions.
#inputs:
#a dataframe
#outputs:
#a dataframe
   '''

    df2=df.copy()

    column_name=df2.columns

    column=[]

    for col in column_name:
    
        col_lower=col.lower()
    
        if col_lower=='st':
        
            column.append(col_lower.replace('st','state'))
    
        elif '' in col_lower:
        
            column.append(col_lower.replace(" ","_")) 
        
    df2.columns=column
        
    return(df2)

In [206]:
df=clean_column(df)
display(df)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they contain only valid data. 

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [207]:
df.dtypes
df['gender'].value_counts()

F         457
M         413
Male       39
female     28
Femal      17
Name: gender, dtype: int64

In [37]:
# Your code here

#solution1:
def clean_gender_column(df: pd.DataFrame) -> pd.DataFrame:
    df2 = df.copy()
    df2['gender'] = list(map(lambda x: x[0].upper() if x[0].upper() in ['M', 'F'] else "U", df['gender']))
    return df2

clean_gender_column(df)['gender'].unique()
#error:'float' object is not subscriptable
#?????

TypeError: 'float' object is not subscriptable

In [325]:
#solution2:
def fix_gender(x):
    
    if str(x[0]).upper()=="F":
        return 'F'
    elif str(x[0]).upper()=="M":
        return 'M'
    else:
        return 'U'
#error:'float' object is not subscriptable
#?????

In [324]:
df['gender'].apply(fix_gender)

TypeError: 'float' object is not subscriptable

In [208]:

def clean_state_name (x): # df.unique : "AZ": "Arizona", "Cali": "California", "WA": "Washington"
    
        if str(x)=='AZ':
            return str(x).replace('AZ','Arizona')
        elif str(x)=='Cali':
            return str(x).replace('Cali','California')
        elif str(x)=='WA':
            return str(x).replace('WA','Washington')
        else: 
            return str(x)

In [209]:
#Horray it worked!
df['state']=df['state'].apply(clean_state_name)
df['state'].unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', 'nan'],
      dtype=object)

In [210]:
def clean_education(x):
    if str(x).startswith('Bachelor') and not str(x).endswith('s'):
        return str(x).replace('Bachelor','Bachelors')
    else:
        return str(x)

In [211]:
df['education']=df['education'].apply(clean_education)

In [212]:
df['education'].unique()

array(['Master', 'Bachelors', 'High School or Below', 'College', 'Doctor',
       'nan'], dtype=object)

In [213]:
def clean_customer_lifetime(x):
    if '%' in str(x):
         return str(x).replace('%','')
    else:
        return x

In [214]:
df['customer_lifetime_value']=df['customer_lifetime_value'].apply(clean_customer_lifetime)

In [215]:
display(df['customer_lifetime_value'])

0              NaN
1        697953.59
2       1288743.17
3        764586.18
4        536307.65
           ...
4003           NaN
4004           NaN
4005           NaN
4006           NaN
4007           NaN
Name: customer_lifetime_value, Length: 4008, dtype: object

In [216]:
df['vehicle_class'].unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury SUV', 'Sports Car',
       'Luxury Car', nan], dtype=object)

In [217]:
def clean_vehicle_class(x):
    if "Luxury" in str(x):
        x="Luxury"
        return x
    else:
        return x

In [218]:
df['vehicle_class'].apply(clean_vehicle_class).unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury', 'Sports Car',
       nan], dtype=object)

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has a wrong format, look at the diffrent values it takes with unique() and take the middle value, for example 1/5/00 should be 5. Number of open complaints is a string, remember you can use split() to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [219]:
# Your code here
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   1071 non-null   object
 1   state                      4008 non-null   object
 2   gender                     954 non-null    object
 3   education                  4008 non-null   object
 4   customer_lifetime_value    1068 non-null   object
 5   income                     1071 non-null   float64
 6   monthly_premium_auto       1071 non-null   float64
 7   number_of_open_complaints  1071 non-null   object
 8   policy_type                1071 non-null   object
 9   vehicle_class              1071 non-null   object
 10  total_claim_amount         1071 non-null   float64
dtypes: float64(3), object(8)
memory usage: 344.6+ KB

In [220]:
df['customer'] = df['customer'].str.replace(r'[^0-9]+','')

/var/folders/4n/stmrxqc53jj_tw3yz1bqld900000gn/T/ipykernel_97923/2235634834.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['customer'] = df['customer'].str.replace(r'[^0-9]+','')

In [221]:
df['customer']

0       50392
1       44356
2       49188
3       63253
4       49547
        ...
4003      NaN
4004      NaN
4005      NaN
4006      NaN
4007      NaN
Name: customer, Length: 4008, dtype: object

In [222]:
df['customer']=pd.to_numeric(df['customer'])
display(df['customer'])

0       50392.0
1       44356.0
2       49188.0
3       63253.0
4       49547.0
         ...
4003        NaN
4004        NaN
4005        NaN
4006        NaN
4007        NaN
Name: customer, Length: 4008, dtype: float64

In [223]:
df['customer_lifetime_value']=pd.to_numeric(df['customer_lifetime_value'])
display(df['customer_lifetime_value'])

0              NaN
1        697953.59
2       1288743.17
3        764586.18
4        536307.65
           ...
4003           NaN
4004           NaN
4005           NaN
4006           NaN
4007           NaN
Name: customer_lifetime_value, Length: 4008, dtype: float64

In [224]:
df['number_of_open_complaints']

0       1/0/00
1       1/0/00
2       1/0/00
3       1/0/00
4       1/0/00
         ...
4003       NaN
4004       NaN
4005       NaN
4006       NaN
4007       NaN
Name: number_of_open_complaints, Length: 4008, dtype: object

In [225]:
def clean_format_complaints(x):
    x=str(x).split('/')
    return x[len(x)-2] #simply writing x[1] gives me an out of range error.

In [226]:
df['number_of_open_complaints']=df['number_of_open_complaints'].apply(clean_format_complaints)

pd.to_numeric(df['number_of_open_complaints'],errors='coerce').unique()

array([ 0.,  2.,  1.,  3.,  5.,  4., nan])

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the isnull() function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (we haven't studied this yet)

Implement your chosen strategy to handle the null values. You can use the fillna() function in pandas to fill null values or dropna() function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the isnull() function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values. 

After formatting data types, as a last step, convert all the numeric variables to integers using applymap.

In [227]:
# Your code here
df.isna().sum()

customer                     2937
state                           0
gender                       3054
education                       0
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints       0
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [228]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   1071 non-null   float64
 1   state                      4008 non-null   object
 2   gender                     954 non-null    object
 3   education                  4008 non-null   object
 4   customer_lifetime_value    1068 non-null   float64
 5   income                     1071 non-null   float64
 6   monthly_premium_auto       1071 non-null   float64
 7   number_of_open_complaints  4008 non-null   object
 8   policy_type                1071 non-null   object
 9   vehicle_class              1071 non-null   object
 10  total_claim_amount         1071 non-null   float64
dtypes: float64(5), object(6)
memory usage: 344.6+ KB

In [229]:
missing_values_df=pd.DataFrame(round(df.isna().sum()/len(df),4)*100)

In [230]:
missing_values_df # the huge amount of the overall data is null for our dataset.

                               0
customer                   73.28
state                       0.00
gender                     76.20
education                   0.00
customer_lifetime_value    73.35
income                     73.28
monthly_premium_auto       73.28
number_of_open_complaints   0.00
policy_type                73.28
vehicle_class              73.28
total_claim_amount         73.28

In [231]:
# since for many rows we have only NA I consider the customer ID and unique and I drop all the rows with NA from the Dataset.
df=df[df['customer'].isna()==False]

In [232]:
df.isna().sum()

customer                       0
state                          0
gender                       117
education                      0
customer_lifetime_value        3
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [233]:
#now we fix the gender. I consider the most frequent value and associate that value to the rest of missing values of course I would introduce some bias to my results.
display(df['gender'].mode()[0])
#display(df['gender'].value_counts(dropna=False))
df['gender']=df['gender'].fillna('F')
len(df[df['gender'].isna()==True])

'F'

0

In [234]:
#now we 'fill the three missing customer lifetime value with the mean.
df['customer_lifetime_value']=df['customer_lifetime_value'].fillna(df['customer_lifetime_value'].mean())
df['customer_lifetime_value'].info()

<class 'pandas.core.series.Series'>
Int64Index: 1071 entries, 0 to 1070
Series name: customer_lifetime_value
Non-Null Count  Dtype
--------------  -----
1071 non-null   float64
dtypes: float64(1)
memory usage: 16.7 KB

In [235]:
df.isna().sum() #all done!

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

## Exercise 5: Dealing with duplicates

Use the .duplicated() method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the drop_duplicates() function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using .duplicated().

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [239]:
# Your code here
df[df.duplicated(keep=False)]

#I see zero duplicated value!

Empty DataFrame
Columns: [customer, state, gender, education, customer_lifetime_value, income, monthly_premium_auto, number_of_open_complaints, policy_type, vehicle_class, total_claim_amount]
Index: []

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting. 

Write these functions in a separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [203]:
# Your code here
#I put almost all in a function. Gender one did not work.

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we tried to do work with that column, we wouldn't have been able to do it because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, lets get some more interesting insights!

Instructions:

- Review again the statistics for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the .describe() method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [ ]:
# Your code here